
__author__ = 'Рутто Юлия Евгеньевна'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

tale = int(a)
a = print("Введите произвольное целое число:")
for (tale = int(a)) {
print tale
continue
}


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

a = input ("введите переменную а:")
b = input ("введите переменную b:")
if a!=a :
print b
if b!=b :
print a

# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

age = input("Введите Ваш возраст:")
if age >= 18 :
print("Доступ разрешен")
if age <= 18 :
print ("Извините, пользование данным ресурсом только с 18 лет")
